mutation {
  insert_route(objects: [
    {
      title: "Stage 1: Port Wakefield to Port Clinton", 
      body: "Start your walk from the Port Wakefield Caravan Park, following the signs towards the north and along the edge of the Clinton Conservation Park.\r\n\r\nThe Port Wakefield to Port Clinton section of Walk The Yorke is designed to be walked as one section (32.8km).  It can also be broken down into 2 sections Port Wakefield to Port Arthur 15km (3 hours 45 mins), and Port Arthur to Port Clinton 17.8km (4 hours 27 mins).\r\n\r\nThis walk takes you through part of the Samphire Coast, with unique ecosystems and mangroves, and a haven for migratory birds.\r\n\r\nYou will walk around the perimeter of the Clinton Conservation Park, which stretches from Port Wakefield to Port Clinton.  It covers an area of 396 hectares, with much of it mangrove swamp, but also important breeding grounds for a variety of marine life.\r\n\r\nPort Arthur was once an active area, with a hotel and a port for shipping goods from Arthurton and now has a roadside camping area for travellers.  As you continue along the trail, you will go past the historic Port Arthur Gaol, sheep troughs and water catchments & dams created by ingenious early settlers.\r\n\r\nThe trail takes you inland from the highway, and a shelter provides an opportunity for 180 degree views of the Hummocks and Gulf St Vincent.\r\n\r\n## Walking Distances & Times\r\nTotal length 32.8km, 8 hours 12 minutes; or broken into 2 smaller sections:\r\n\r\n- Port Wakefield to Port Arthur 15km (3 hours 45 minutes)\r\n- Port Arthur to Port Clinton 17.8km (4 hours 27 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 2: Port Clinton to Ardrossan", 
      body: "Starting from Port Clinton, follow the Walk The Yorke signs south out of town and towards Price.\r\n\r\nThe Port Clinton to Ardrossan section of Walk The Yorke is designed to be walked as one section (27.8km), but can be walked in 2 sections  The 2 sections are Port Clinton to Price 7.8km (1 hour 57 mins), and Price to Ardrossan 20km (5 hours).\r\n\r\nThe Samphire Coast continues down the western side of Gulf St Vincent (eastern coastline of Yorke Peninsula) to Ardrossan, with many mangrove habitats found along the way.\r\n\r\nWills Creek Conservation Park at Price is a popular spot for visitors, and can be accessed from the causeway from the township, along with the boat ramp.\r\n\r\nPrice is also a location for one of Yorke Peninsula’s key mining industries, salt.  Cheetham Salt uses a solar process for harvesting salt, and the huge salt pans can be seen alongside the township and as you cross the causeway to Wills Creek.  Cheetham Salt provides Saxa table salt and pool salt, and was once the largest salt refinery in the Southern Hemisphere producing over 1000 tonnes per week.\r\n\r\nContinue heading south from Price, and join up with the CH Smith Trail at Tiddy Widdy Beach.  Continue along this coastal trail before arriving at Ardrossan.\r\n\r\nThere are plenty of accommodation options in Ardrossan, including caravan parks, motel & hotel units, and self-contained holiday houses.   You can choose to spend the night or a few days, and don’t forget to try your hand at catching Blue Swimmer crabs; best in the months with an ‘r’ when the waters are warmer.\r\n\r\nWhile in Ardrossan, don’t forget to visit the Ardrossan Museum, home of the Stump Jump Plough, invented by local farmers in 1876.  The Ardrossan Museum is the former factory of the plough, and has a wealth of history.\r\n\r\n## Walking Distances & Times\r\nTotal length 27.8km (6 hours 57 minutes); or broken into 2 smaller sections:\r\n\r\n- Port Clinton to Price 7.8km (1 hour 57 minutes)\r\n- Price to Ardrossan 20km (5 hours)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 3: Ardrossan to Pine Point", 
      body: "One of the shorter walks on Walk The Yorke, start at the Ardrossan Jetty and follow the signs south out of town towards the highway, and then on to Pine Point.\r\n\r\nYou can walk the full 18.8km from Ardrossan to Pine Point (one-way), or choose to do one of the smaller walks that makes up this section - Ardrossan to James Well 8.1km (2 hours), James Well to Rogues Point 1.6km (25 mins) and Rogues Point to Pine Point 9.1km (2 hours 17 mins).\r\n\r\nJust on the southern edge of Ardrossan, you will pass the loading jetty and mining operations.  Ardrossan is a hub of industry, with salt from Price shipped from the jetty; and the Viterra silos and bunkers a depot for local farmers reaping crops at harvest (grain isn’t shipped from here, but transported by road train south to Port Giles). \r\n\r\nThe Arrium mine extracts dolomite, which is shipped out to other ports.  One of the best views over Ardrossan & Gulf St Vincent can be found at the Arrium Lookout, just near the mine operations; don’t miss this birds-eye view and a great photo opportunity.\r\n\r\nAfter getting that perfect photo, continue south and turn left onto Parara Road towards the coast.  Parara is the Aboriginal word for ‘middle’, and this area was home to the Parara Homestead owned by the Bowmans, who were pioneers in farming & sheep grazing across the state and went on to have the township of Bowmans in the Mid-North named after them and built Martindale Hall, near Clare.\r\n\r\nParara Beach is a popular crabbing beach, with many venturing out with their crab rakes in the warmer months (September to April) to gather Blue Swimmer crabs.  In December 2014, it was also the location of the extraordinary and significant marine event, where 7 Sperm Whales were found stranded after beaching themselves at low tide.  A memorial on the coast at Parara Beach honours this event, which was the first of its kind in over 200 years in South Australian history.\r\n\r\nHead south along the coastline and join up with the James Well/Rogues Point Trail that goes to Pine Point. \r\n\r\nJames Well & Rogues Point are small settlements that offer fantastic crabbing, fishing & watersports.  There are self-contained holiday houses available in both towns.\r\n\r\nHead further south along the designated trail, and as you pass the cliffs just north of Pine Point, you will notice a white clay material, rich in Kaolin, which is used for making porcelain and bone china.  Although considered, the clay deposits (estimated to be more than 66,000 tonnes) were never extracted.\r\n\r\n## Walking Distances & Times\r\nAll distances are one-way, as Walk The Yorke is a continuous linear trail covering more than 500kms.\r\nTotal length 18.8km (4 hours 42 minutes); or broken into 3 smaller sections:\r\n\r\n- Ardrossan to James Well 8.1km (2 hours)\r\n- James Well to Rogues Point 1.6km (25 minutes)\r\n- Rogues Point to Pine Point 9.1km (2 hours 17 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 4: Pine Point to Port Vincent", 
      body: "Providing some spectacular views over Gulf St Vincent, the Pine Point to Port Vincent section has some of the most varied trail types on Walk The Yorke.  There are 4 different trail types; walking, cycling, beach walks, and shared walking/cycling.\r\n\r\nHeading south from Pine Point, walkers & cyclists share the same path until the turn off the Black Point.   From here, cyclists continue along the highway to Port Julia, while walkers following the coastline, first along the designated trail then along a beach walk.\r\n\r\nFor walkers who follow the trail to Black Point  and for cyclists who detour before join back up with the bike trail along the highway  Black Point has some amazing history for such a small place.\r\n\r\nOnce a 19th century quarantine station, Black Point is now one of the most prized pieces of real estate in South Australia.  With around 150 ‘shacks’ lining the beachfront, or Millionaire’s Row, and a plentiful crabbing ground on the doorstep, Black Point has certainly turned it’s fortunes around in the last 200 years.\r\n\r\nThe walking trail curves along the beachfront of Black Point, and along the roadside behind the shacks, before heading south once at the point.  From here it becomes a beach walk until you get to Port Julia.\r\n\r\nCyclists follow the St Vincent Highway, before taking the first turn off to the left towards Port Julia and the coast.  Port Julia was once a busy port with wheat and barley being loaded onto ketches bound for Port Adelaide. Today, the jetty and cargo shed (known as the ‘Red Shed’ remain as a reminder of the town’s maritime history.\r\n\r\nFrom Port Julia, Walk The Yorke continues south towards Port Vincent, with the trail shared between walkers & cyclists.  Not too far from Port Julia, you’ll come across ‘The Dipper’, a favourite with Yorkes locals for it’s shacks and secluded location.\r\n\r\nHeading further towards Port Vincent is Sheoak Flat, before the walk continues along the cliffside with amazing views not normally seen on a drive to Yorke Peninsula.  It’s worth getting out of the car for!\r\n\r\nAs you get closer to Port Vincent, you’ll pass the Port Vincent Golf Course and be sure to stop at the Port Vincent Marina Lookout soon after.  It’s got some great views over the marina, bay and Port Vincent township.\r\n\r\n## Walking Distances & Times\r\nTotal length 28.5km (7 hours 8 minutes); or broken into 4 smaller sections:\r\n\r\n- Pine Point to Black Point 4.8km (1 hour 12 minutes)\r\n- Black Point to Port Julia 9 km (2 hours 15 minutes)\r\n- Port Julia to Sheoak Flat 4.8km (1 hour 12 minutes)\r\n- Sheoak Flat to Port Vincent 9.9km (2 hours 29 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 5: Port Vincent to Stansbury", 
      body: "One of the shortest sections of Walk The Yorke, Port Vincent to Stansbury is just under 18 kilometres in length, and allows you to experience all 4 different trail types; walking, cycling, beach walks, and shared walking/cycling.\r\n\r\nPort Vincent is a favourite holiday playground, and a popular destination for yachties.  It also has a strong community spirit with a dedicated Tidy Towns group who have been instrumental in creating some of the existing town walking trails. For this section of Walk The Yorke, start from Port Vincent, and follow the Ralph Munro Walking Trail heading south from the township.\r\n\r\nAfter following the signage along the Port Vincent back beach, walkers will continue south along the clifftop, while cyclists are taken along the highway before heading towards the coast again to join up with the trail near Devils Gully Shelter.\r\n\r\nFrom here, it’s a shared walk/bike trail heading south, before splitting once again with the cyclists back to the highway, and walkers following a beach trail around the cliff face.\r\n\r\nAt Beach Hut, Walk The Yorke once again becomes a shared trail continuing south towards and then into Stansbury.\r\n\r\nOriginally known as Oyster Bay, Stansbury is still a producer of oysters and the oyster farms can be seen out in the bay.  Visit one of the oyster farms (on land) to purchase local oysters or learn more about them on a tour.\r\n\r\nWhen following the trail into Stansbury, you will join up with the 3 existing town trails, commencing at Mills Gully, along the foreshore, and then south to Pitts Cutting.\r\n\r\n## Walking Distances & Times\r\nTotal length 17.6km (4 hours 24 minutes); or broken into 3 smaller sections:\r\n\r\n- Port Vincent to Lime Kiln Gully 7.2km (1 hour 48 minutes)\r\n- Lime Kiln Gully to Beach Hut 2km (30 minutes)\r\n- Beach Hut to Stansbury 8.4km (2 hours 6 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 6", 
      body: "Starting at Stansbury’s foreshore, following the existing town trails around the point, along the back beach and south away from town.  Along this trail, you can view historic interpretive signage, and information about flora & fauna.\r\n\r\nFrom Pitts Cutting , you will be able to see Kleins Point in the distance, a limestone quarry operated by Adelaide Brighton Cement.  On certain days, the Accolade 2 will be in port, to ferry the limestone across to Birkenhead.  The trail moves away from the coast at Pitts Cutting where it heads inland to join the highway for a short distance before detouring towards Wool Bay. \r\n\r\nWhilst this section is a total distance of 29.2 kilometres, you can break it down into 3 smaller manageable walks and all trails are shared for walker & cyclist:\r\n\r\nStansbury to Wool Bay 14km (3 hours 39 minutes)\r\nWool Bay to Hickeys Point 5.5km (1 hour 23 minutes)\r\nHickeys Point to Edithburgh 9.4km (2 hours 18 minutes)\r\nWool Bay was named because it had a cutting wide enough to roll a bale of wool down to beach, before it was loaded onto a ship bound for Port Adelaide.   It is also well known for the remains of its iconic lime kiln, the only 1 of 6 remaining which can still be seen on the cliffs above the town jetty.\r\n\r\nLeaving Wool Bay, head south towards Coobowie.  On the right hand side just before the grain depot is Barachel Alpacas, part of the Yorke Peninsula Home Grown Trail; here baby alpacas are on site most of the year and you can cuddle & feed them (be sure to call ahead first, as this is also a working farm).\r\n\r\nJust a little further on is Port Giles, a deep sea port for transporting grains all over the world.  Spring & summer time means harvest with lots of grain truck bringing their loads to Port Giles, so be careful walking or cycling.  You can fish off the Port Giles Jetty, but as it is a working port, only when there is not a cargo ship in port.  If you would like to fish off this jetty while on Walk The Yorke, check access at www.portmis.flindersports.com.au. \r\n\r\nHickeys Point is just a short walk from Port Giles, and has a Walk The Yorke shelter (one of many around the whole region).  It’s a favourite boat launch area for fishers looking for a seafood catch.\r\n\r\nFollowing the trail signage around, continue on to Coobowie.  Originally called Deception Bay, early settlers once considered it the location for a big city, but changed their mind once they could not find any fresh water sources.  Coobowie also made the record books in 1848 when 3 bushrangers, who had escaped from Tasmania, wrecked their boat off Kangaroo Island before arriving at Coboowie in a stolen boat; an Inspector Tolmer arrested them, before they were escorted back to Tasmania and hung.\r\n\r\nAt the southern edge of Coobowie, is the causeway and bird hide, with the causeway home to many migratory birds and a key breeding area for fish stocks.  Installed by the local progress committee, the bird hide offers a view of bird feeding at the low water line in the Coobowie Estuary, pick up a bird identification brochure from the General Store or Caravan Park and become an ornithologist for a while.\r\n\r\nFollow the trail as it winds its way along the coastline towards Edithburgh, where you’ll come to the golf course on the coastal side and the Edithburgh Cemetery on the other. \r\n\r\nEdithburgh Cemetery is believed to have the largest mass grave in Australia  that of the 31 Lascar (Filipino & Indian) seamen who died in the Clan Ranald shipwreck in 1909.  They were buried in one large grave marked ‘names unknown’ until 2009 (the 100th anniversary), when a plaque listed the name of each seamen.  \r\n\r\nEdithburgh was once the 3rd busiest port in South Australia, with salt, lime and gypsum all shipped to Adelaide from the jetty. Visit the Edithburgh Museum for an insight into the thriving mining and shipping industry that once operated from Edithburgh.\r\n\r\nIf you feel like a swim, just along the beachfront from the jetty is the Edithburgh Tidal Swimming Pool.  Built in the 1930’s by a ‘work for the dole’ group, and with local farmers donating labour & stone, the pool is a popular spot during the warmer months.\r\n\r\n\r\n## Walking Distances & Times\r\nTotal length 29.2km (7 hours 20 minutes); or broken into 3 smaller sections:\r\n\r\n- Stansbury to Wool Bay 14km (3 hours 39 minutes)\r\n- Wool Bay to Hickeys Point 5.5km (1 hour 23 minutes)\r\n- Hickeys Point to Edithburgh 9.4km (2 hours 18 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 7", 
      body: "Starting from the Edithburgh Jetty, you can see Troubridge Island towards the south-east.  The Troubridge Island lighthouse is now retired, but was built in 1856 and was the only pre-fabricated cast iron lighthouse in South Australia.\r\n\r\nTroubridge Island is a recognised Conservation Park, and you can also rent the whole island, staying the in the lighthouse keeper’s cottage. With only one booking at a time, you will have it all to yourself…apart from the Little Penguins that call the island home, the thousands of migratory birds that visit each year, and the dolphins frolicking nearby.  Why not take a break from Walk The Yorke and book a stay with Troubridge Island Hideaway (phone 8852 6290).\r\n\r\nFollow the shared walk/bike Mosaic Trail from Edithburgh to Sultana Point, a distance of 3.4km (51 minutes).  This arty trail was the brainchild of a local artist Trudie Howith, and with assistance from other local artists & community members, rocks along the trail were  mosaicked in a nautical theme.\r\n\r\nThe next section of the walk takes you to Port Moorowie, which is 27.3km from Sultana Point along the rugged Yorke Peninsula coastline.   \r\n\r\nFrom Sultana Point, followed the shared trail westward around the ‘heel’ of the peninsula.  Just near you, you will see the 55 large wind turbines that make up the Wattle Point Wind Farm, which have covered the 17.5km area since 2005 harvesting the natural resource of the wind that buffets Yorke Peninsula’s southern coastline.\r\n\r\nThe trail briefly splits, with the walking trail following the coastline and the cycling trail just a little further inland along the road; before coming back together as a shared trail.  Have a rest at the Wattle Point Shelter, or go on a little further to camp for a night or 2 at either the Sheoak Beach or Goldsmith Beach camp spots (camping permits required)\r\n\r\nContinuing on from Goldsmith’s Beach, the shared trail heads towards the Troubridge Hill Lighthouse.  It’s worth a visit to the lighthouse to view its unique design up close.  Measuring 32 metres high, Troubridge Hill Lighthouse has a light range of 22 nautical miles and operates off mains electricity with a backup generator.  This unusual lighthouse is built with custom-made special wedge shaped clay bricks, and it is designed to be resistant to high winds and earthquakes, as in the early 1900's the area experienced numerous earthquakes.\r\n\r\nFollowing the trail, it will again split into a walking trail and a cycling trail, and you will come to another camping spot, Kemp Bay and the trail’s Kemp Bay Shelter.\r\n\r\nFrom here, the trail continues as a shared walk/bike trail into Port Moorowie.\r\n\r\n## Walking Distances & Times\r\nTotal length 30.7km (7 hours 41 minutes); or broken into 2 smaller sections:\r\n\r\n- Edithburgh to Sultana Point 3.4km (51 minutes)\r\n- Sultana Point to Port Moorowie 27.3km (6 hours 50 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 8", 
      body: "Starting this section in Port Moorowie, don’t miss the opportunity to follow the Port Moorowie Coastal Walk.  Commencing at the main car park, there are two walks  one that goes to the east for 1.5km and explores the coastal dunes, and the reef walk that is 1km to the west.  You can also talk the opportunity to explore the Port Moorowie Coastal Display Garden.\r\n\r\nWalk The Yorke leaves Port Moorowie as a split trail, with walkers following the trail along the town’s beach front before weaving it’s way around Mozzie Flat.  Cyclists follow Green Hill Road from Port Moorowie and can head towards the coast to the Mozzie Flat Shelter, and camping area (camping permits apply).  The first part of this section from Port Moorowie to Mozzie Flat Road is 3km (45mins), and is a great opportunity for spotting wildflowers.\r\n\r\nLeaving the Mozzie Flat Shelter, cyclists head back to the road and continue towards Foul Bay in a westerly direction.\r\n\r\nWalkers have more options for exploring this part of Yorke Peninsula, with a beach walk from the Mozzie Flat Shelter, to Sturt Bay, where they can stop for a rest at the Sturt Bay Shelter.  From Sturt Bay, the beach walk continues until reaching Point Davenport Conservation Park, where the walking trail goes along the edge of the park.\r\n\r\nLocated on a headland between Foul Bay and Sturt Bay on the south coast of Yorke Peninsula, Point Davenport Conservation Park is considered to be an area of high biodiversity.  It has a range of habitats including beaches, foredunes, and an estuary that is listed as a nationally important wetland.  This section of Walk The Yorke from Mozzie Flat Road to Point Davenport is 16.9km (4 hours 14 mins).\r\n\r\nAt the intersection of South Coast Road, Wild Dog Hill Road and Nugent Road; the walking & cycling trails join up as a shared trail to head into Foul Bay, with this last part from Point Davenport to Foul Bay a distance of 17.9km, approximately 4 hours 29 minutes.\r\n\r\nWhilst an unusual name, it’s believed Foul Bay to be named after the mounds of decaying seagrass on the long beach.  Foul Bay is a secluded spot with holiday houses and shacks, and has 16km of south-west facing sandy shores along the bay. \r\n\r\n## Walking Distances & Times\r\nTotal length 37.8km (9 hours 28 minutes); or broken into 3 smaller sections:\r\n\r\n- Port Moorowie to Mozzie Flat Road 3km (45 minutes)\r\n- Mozzie Flat Road to Point Davenport 16.9km (4 hours 14 minutes)\r\n- Point Davenport to Foul Bay 17.9km (4 hours 29 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 9", 
      body: "One of the most rewarding  but challenging  sections of the Walk The Yorke trail, from Foul Bay to Marion Bay it is a total of 25.3km in length, expected to take approximately 6 hours 20 minutes.\r\n\r\nExperienced walkers recommend allowing up to 10 hours to complete this section of Walk The Yorke from Foul Bay to Marion Bay, due to the varying terrains including beach walks, dune climbs & rock-hopping.\r\n\r\nThere are plenty of photo opportunities throughout this section of Walk The Yorke, so don’t forget your camera!\r\n\r\nLeaving Foul Bay as a shared walking & cycling trail, the trail heads south-west towards Point Yorke.  A must-stop spot for this section of Walk The Yorke is the Kangaroo Island Lookout, which offers views across Investigator Strait to Kangaroo Island. \r\n\r\nAfter Point Yorke, cyclists continue down the South Coast Highway to Marion Bay, whilst walkers follow the marked walking trail and beach walks along the coastline.\r\n\r\nThe Meehan Hill Lookout is another lookout worth a stop  and a photo - walkers will go past this area, while cyclists can choose to detour towards the coast to this lookout, before re-joining the cycling trail.\r\n\r\nThe trail for walkers continues towards Marion Bay as a beach walk, with picturesque scenery and challenging treks  including rock-hopping and dune climbs.\r\n\r\nWalkers & cyclists join up on the shared trail just before Marion Bay, and follow Walk The Yorke signage into the small coastal township.\r\n\r\n## Walking Distances & Times\r\nTotal length 25.3km (6 hours 20 minutes); or broken into 2 smaller sections:\r\n\r\n- Foul Bay to Kangaroo Island lookout 5.6km (1 hour 24 minutes)\r\n- Kangaroo Island lookout to Marion Bay 19.7km (4 hours 56 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 10", 
      body: "Marion Bay is a small coastal township, said to be named after the steamer ‘Marion’ which was shipwrecked there in 1862.  This section of Walk The Yorke starts at the Marion Bay Jetty, and is one of the longest, taking over 13 hours and covering a distance of more than 53 kilometres.\r\n\r\nFrom Marion Bay, cyclists & walkers travel along the shared trail in a south-westerly direction towards Stenhouse Bay.  The trail will take you through the entrance to Innes National Park and past the Natural Resources Centre (walkers & cyclists are excempt from entrance fees).\r\n\r\nStenhouse Bay Jetty is worth a stop before continuing on through the park on the designated trail. The jetty was once used for the exporting of gypsum, which was mined in the Inneston village within the National Park.  Today the jetty is popular for fishing, and provides a great photo opportunity.\r\n\r\nJust up from the jetty is another spot worth a visit.  A Vietnamese seaman, Dao Thanh was buried on the clifftop overlooking the jetty in 1940, after he broke his neck in an accident upon a ship that was collecting gypsum bound for Noumea.  Unsure how to deal with a death at sea, it was decided to bury Dao Thanh in a Buddhist ceremony at Stenhouse Bay, however the grave remained unmarked until 1997 when the Vietnamese community erected a memorial plaque on the grave.\r\n\r\nWithin Innes National Park, walkers & cyclists follow 2 different trails, so please take note of the signage and directions.\r\n\r\nSome of the experiences in Innes National Park are off the Walk The Yorke trail, including Cape Spencer Lighthouse and West Cape.  They are worth a visit, but please remember that Innes National Park has roaming wildlife and to be mindful of the vehicles in the park.\r\n\r\nThere are camping opportunities within the park  but if you plan to stay the night, please book ahead to avoid being disappointed.  If you don’t feel like camping, Inneston has self-contained accommodation available.\r\n\r\nContinue to follow the Walk The Yorke trail through Innes National Park  from Pondalowie Bay it’s a shared trail for walkers & cyclists  and stop in at Shell Beach, Browns Beach and Gym Beach along the way.\r\n\r\nAt Gym Beach, and where Walk The Yorke leaves Innes National Park, the trail splits once again with walkers following the coastline on walking trails & beach walks, and cyclists a little further inland along the established roads.\r\n\r\nThe Southern coastline, from Gym Beach to Daly Head provide some of South Australia’s best surfing, with popular spots including Baby Lizards and Formby Bay.   Daly Head has been recognised as a National Surfing Reserve and is worth a visit; plus, provides yet another photo opportunity.\r\n\r\n## Walking Distances & Times\r\nTotal length 53.1km (13 hours 16 minutes); or broken into 4 smaller sections:\r\n\r\n- Marion Bay Jetty to Gym Beach 30.4km (7 hours 36 minutes)\r\n- Gym Beach to Formby Bay 10km (2 hours 30 minutes)\r\n- Formby Bay to Daly Head 8.5km (2 hours 7 minutes)\r\n- Daly Head to Gleesons Landing 4.2km (1 hour 3 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 11", 
      body: "Walkers start this section of Walk The Yorke from Gleesons Landing, before travelling the 20.5 kilometres (4 hours 58 minutes) to Corny Point around Yorke Peninsula’s toe. \r\n\r\nYou can camp overnight at Gleesons Landing (permit required) before starting your trek, or just choose to walk one of the 3 smaller walks listed below.\r\n\r\nThe trail for walkers alternates between a walking trail and beach walk throughout this section, but it means a variety of experiences…from small beaches with soft sands to coastline pounded by the Southern ocean.\r\n\r\nFor cyclists, some of this section is inaccessible and because of this the bike trail doesn’t begin at Gleeson’s Landing, but instead follows established rural roads with local names, West Coast Road, Gleeson’s Road, Marion Bay Road and Point Annie Road, before joining up with the walking trail at Point Annie.\r\n\r\nSome of the best surfing beaches in South Australia can be found along this section of Yorke Peninsula’s coastline, and you might be lucky enough to see some talented local surfers in action.  Or perhaps even dolphins catching a wave?\r\n\r\nFrom Point Annie, the walking and cycling trails run parallel along the coastline and past the Corny Point Lighthouse.\r\n\r\nContinue in an easterly direction into the Corny Point township, where you can choose to spend the night in a holiday house or at the caravan park; or grab a drink at the tavern or general store before heading on to the next park of the trail.\r\n\r\n## Walking Distances & Times\r\nTotal length 20.5km (4 hours 58 minutes); or broken into 3 smaller sections:\r\n\r\n- Gleesons Landing to Swincer Rocks Point  3.9km (58 minutes)\r\n- Swincer Rocks Point to Point Annie 2.7km (41 minutes)\r\n- Point Annie to Corny Point  13.9km (3 hours 29 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 12", 
      body: "Start this section of Walk The Yorke at Corny Point, before heading east to The Pines which takes 2 hours 44 minutes to cover a distance of 10.6 kilometres.  Walkers follow the beach all the way to The Pines, while cyclists use the road.\r\n\r\nAfter The Pines, the beach walk continues for walkers to Point Souttar, past Leven Beach Conservation Park and Burners Beach (9.8km, 2 hours 27 minutes).  The cycling trail once again follows the road, before meeting up with the walking trail at the Burners Beach Shelter.\r\n\r\nFrom the Burners Beach Shelter, walkers & cyclists follow the shared trail to Point Turton.  On the way, it passes a spot to the west of Point Turton, known as ‘The Drain’.  This was a channel dug in 1900 by around 20 men to drain a big swamp area, and took around 50 weeks to complete.  ’The Drain’ comes out into the sea near a place called Chinaman’s Camp, where Chinese workers used to catch and cure fish.\r\n\r\nThe last part of this section, from Point Souttar to Point Turton Jetty is 11km and takes 2 hours 45 minutes.  Just near the jetty, you will see the Point Turton Caravan Park, which is built on the old limestone quarry.  Limestone was extracted from the quarry between 1906 and 1919 and sent to Port Pirie, where it was used as flux at the smelters.\r\n\r\n## Walking Distances & Times\r\nTotal length 31.7km (7 hours 56 minutes); or broken into 3 smaller sections:\r\n\r\n- Corny Point to The Pines 10.9km (2 hours 44 minutes)\r\n- The Pines to Point Souttar 9.8km (2 hours 27 minutes)\r\n- Point Souttar to Point Turton Jetty 11km ( hours 45 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 13", 
      body: "Heading towards the north from Point Turton, this section of the Walk The Yorke trail can be broken down into the 5 smaller trails listed below.\r\n\r\nIn the first part of this section a beach walk takes walkers along firm beaches with rock outcrops, while cyclist following the road network to Hardwicke Bay.  Just north of Point Turton, walkers will come across Flaherty’s Beach which is the base for a popular annual event.  The Flaherty’s Beach Golf Classic is held every summer and played on the sand, with many locals and visitors taking part.  It’s worth a look, and cyclists can head towards the coast before re-joining the trail.\r\n\r\nHeading further north, Hardwicke Bay is a fantastic small coastal town, and the tractors lined up on the beach are always a sight to behold.  With no concrete boat ramp here, the best option is to use a tractor to launch your boat and the colourful line-up of tractors is a Hardwicke Bay tradition.\r\n\r\nThe trail continues north, and varies between a shared trail, beach walk and bike track; before splitting at Parsons Beach with walkers following the coastline, and cyclists along the roads.\r\n\r\nBluff Beach retains some important Yorke Peninsula maritime history, with boat hoists that were used by local fishermen to hoist their boat out of the water in bad weather.  There are 2 boat hoists remaining following a storm in 1954, but there were 6 erected back in 1925.\r\n\r\nFrom Barkers Rocks, keep heading north along the shared walking/cycling trail until you reach Port Rickaby. \r\n\r\nPort Rickaby’s Jetty was built in 1879, with a length of 121.9m (400 feet) and a low-water depth of 3.3m; this meant that cargo could be loaded directly onto the international sailing ships, instead of being ferried by ketches.\r\n\r\n## Walking Distances & Times\r\nTotal length 41.6km (10 hours 25 minutes); or broken into 5 smaller sections:\r\n\r\n- Point Turton to Hardwicke Bay Shelter  14.1km (3 hours 32 minutes)\r\n- Hardwicke Bay Shelter to Pt Minlacowie 7.4km (1 hour 51 minutes)\r\n- Pt Minlacowie to Parsons Beach 10.2km (2 hours 33 minutes)\r\n- Parsons Beach to Bluff Beach 2km (30 minutes)\r\n- Bluff Beach to Pt Rickaby Jetty 7.9km (1 hour 59 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 14", 
      body: "From Port Rickaby heading north towards Port Victoria, walkers follow a beach walk for almost the entire section of 21.6 kilometres, while cyclists follow the roads, before joining up on a shared trail just south of the Port Victoria township.\r\n\r\nThe Walk The Yorke trail is most definitely about the beach throughout this section.  Long wide beaches with shallow, crystal blue waters can be found as far as the eye can see.  There are also dune systems all along the coastline, which have coastal vegetation to help protect them.\r\n\r\nThis part of Walk The Yorke goes along Wauraltee Beach, where you can camp the night or a few days.  There is also the Wauraltee Beach Shelter if you just want to take a rest from your walk.\r\n\r\nWalk The Yorke continues north before meeting up with the cycling trail, before going past Rifle Butts Beach & South Beach, just before Port Victoria.  The shared trail follows the coastline into Port Victoria; past the golf course, jetty and maritime museum.\r\n\r\n## Walking Distances & Times\r\nTotal length 21.6km (5 hours 24 minutes); or broken into 2 smaller sections:\r\n\r\n- Port Rickaby to Wauraltee Beach 9.9km (2 hours 28 minutes)\r\n- Wauraltee Beach to Port Victoria 11.7km (2 hours 56 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 15", 
      body: "The Port Victoria to Balgowan section of Walk The Yorke is one of the shorter sections at a distance of 21.3 kilometres, and taking 5 hours 20 minutes.\r\n\r\nKnown as the ‘last of the windjammer ports’, Port Victoria was a hive of activity in the late 1800’s and early 1900’s with the shipping grain overseas via Cape Horn.  Port Victoria was the last port in Australia to load a windjammer, which earnt the town it’s nickname; there is a memorial near the town jetty to commemorate its maritime heritage.\r\n\r\nPort Victoria was where the Great Grain Races began, where in 1932 twenty ships loaded with wheat left Port Victoria bound for the English Channel (a distance of 24,139 kilometres).  The ‘Parma’ won the race in 1932, completing the voyage in 83 days.\r\n\r\nOff the coastline of Port Victoria is Wardang Island, which is 8.4 x 2.4 kilometres and covers an area of around 2,025 hectares.\r\n\r\nFrom Port Victoria through to Balgowan, the entire section of Walk The Yorke has a shared trail for walkers & cyclists.\r\n\r\nJust to the north of Port Victoria, the trail goes inland through the Nharangga Aboriginal Lands and Point Pearce.  This area is culturally significant for Yorke Peninsula, with a wealth of history.  It is also home to the Southern Hairy-nose Wombat, and their warrens can be seen throughout.\r\n\r\nThe shared walking/cycling trail continues north to Balgowan, once a shipping port and now a coastal holiday retreat.\r\n\r\n## Walking Distances & Times\r\nTotal length 21.3km (5 hours 20 minutes); or broken into 2 smaller sections:\r\n\r\n- Port Victoria to Chinaman Wells Road 12.7km (3 hours 11 minutes)\r\n- Chinaman Wells Road to Balgowan 8.6km (2 hours 9 minutes)\r\n", 
      type_id: 1
    },
    {
      title: "Stage 16", 
      body: "Following the shared trail north from Balgowan, cyclists & walkers head past Tiparra Rocks, The Bamboos and on to The Gap in the first part of this section of Walk The Yorke.  There are several camping spots along this stretch of coastline, and it is a great spot to get away from it all.\r\n\r\nFor walkers, it’s a beach walk the rest of the way. Walkers follow the coastline to Cape Elizabeth and around the point, before heading north to Port Hughes and beyond to Moonta Bay.\r\n\r\n## Walking Distances & Times\r\nTotal length 41.1km (10 hours 12 minutes); or broken into 4 smaller sections:\r\n\r\n- Balgowan to The Gap 11.1km (2 hours 46 minutes)\r\n- The Gap to Tiparra Springs 5.1km (1 hour 17 minutes)\r\n- Tiparra Springs to Coopers Beach Road 15.1km (3 hours 46 minutes)\r\n- Coopers Beach Road to Moonta Bay 9.8km (2 hour 23 minutes)\r\n", 
      type_id: 1
    },
  ], 
  on_conflict: {constraint: route_pkey, update_columns: body}) {
    returning {
      title
      body
      type {
        name
      }
    }
  }
}
